; domain
(define (domain satellite)
  (:requirements :strips :typing)
  (:types satellite direction instrument mode)
  (:predicates 
	(on_board ?i - instrument ?s - satellite)
	(supports ?i - instrument ?m - mode)
	(pointing ?s - satellite ?d - direction)
	(power_avail ?s - satellite)
	(power_on ?i - instrument)
	(calibrated ?i - instrument)
	(have_image ?d - direction ?m - mode)
	(calibration_target ?i - instrument ?d - direction))
 
  (:action turn_to
   :parameters (?s - satellite ?d_new - direction ?d_prev - direction)
   :precondition (and (pointing ?s ?d_prev))
   :effect (and  (pointing ?s ?d_new)
                 (not (pointing ?s ?d_prev))))
 
  (:action switch_on
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s) 
                      (power_avail ?s))
   :effect (and (power_on ?i)
                (not (calibrated ?i))
                (not (power_avail ?s))))

  (:action switch_off
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s)
                      (power_on ?i))
   :effect (and (not (power_on ?i))
                (power_avail ?s)))

  (:action calibrate
   :parameters (?s - satellite ?i - instrument ?d - direction)
   :precondition (and (on_board ?i ?s)
		      (calibration_target ?i ?d)
                      (pointing ?s ?d)
                      (power_on ?i))
   :effect (calibrated ?i))

  (:action take_image
   :parameters (?s - satellite ?d - direction ?i - instrument ?m - mode)
   :precondition (and (calibrated ?i)
                      (on_board ?i ?s)
                      (supports ?i ?m)
                      (power_on ?i)
                      (pointing ?s ?d))
   :effect (have_image ?d ?m)))

; problem
(define (problem strips-sat-u-5)
(:domain satellite)
(:objects
	satellite0 - satellite
	instrument0 - instrument
	satellite1 - satellite
	instrument1 - instrument
	instrument2 - instrument
	instrument3 - instrument
	satellite2 - satellite
	instrument4 - instrument
	instrument5 - instrument
	satellite3 - satellite
	instrument6 - instrument
	instrument7 - instrument
	satellite4 - satellite
	instrument8 - instrument
	instrument9 - instrument
	instrument10 - instrument
	satellite5 - satellite
	instrument11 - instrument
	satellite6 - satellite
	instrument12 - instrument
	instrument13 - instrument
	instrument14 - instrument
	satellite7 - satellite
	instrument15 - instrument
	instrument16 - instrument
	spectrograph1 - mode
	image2 - mode
	thermograph0 - mode
	GroundStation0 - direction
	GroundStation1 - direction
	GroundStation2 - direction
	Star3 - direction
	Star4 - direction
	Phenomenon5 - direction
	Phenomenon6 - direction
	Star7 - direction
	Phenomenon8 - direction
	Planet9 - direction
	Phenomenon10 - direction
	Star11 - direction
	Star12 - direction
	Phenomenon13 - direction
	Star14 - direction
	Phenomenon15 - direction
	Planet16 - direction
	Star17 - direction
	Planet18 - direction
	Star19 - direction
	Star20 - direction
	Star21 - direction
	Phenomenon22 - direction
	Star23 - direction
	Star24 - direction
	Star25 - direction
	Phenomenon26 - direction
	Planet27 - direction
	Phenomenon28 - direction
	Phenomenon29 - direction
	Planet30 - direction
	Planet31 - direction
	Planet32 - direction
	Phenomenon33 - direction
	Star34 - direction
	Planet35 - direction
	Planet36 - direction
	Star37 - direction
	Star38 - direction
	Planet39 - direction
	Phenomenon40 - direction
	Star41 - direction
	Phenomenon42 - direction
	Phenomenon43 - direction
	Star44 - direction
	Star45 - direction
	Star46 - direction
	Star47 - direction
	Star48 - direction
	Phenomenon49 - direction
	Star50 - direction
	Planet51 - direction
	Star52 - direction
	Planet53 - direction
	Star54 - direction
	Phenomenon55 - direction
	Star56 - direction
	Planet57 - direction
	Phenomenon58 - direction
	Star59 - direction
	Planet60 - direction
	Planet61 - direction
	Planet62 - direction
	Planet63 - direction
	Star64 - direction
	Star65 - direction
	Planet66 - direction
	Planet67 - direction
	Planet68 - direction
	Star69 - direction
	Phenomenon70 - direction
	Phenomenon71 - direction
	Planet72 - direction
)
(:init
	(supports instrument0 thermograph0)
	(supports instrument0 spectrograph1)
	(supports instrument0 image2)
	(calibration_target instrument0 GroundStation2)
	(on_board instrument0 satellite0)
	(power_avail satellite0)
	(pointing satellite0 Star44)
	(supports instrument1 spectrograph1)
	(supports instrument1 image2)
	(supports instrument1 thermograph0)
	(calibration_target instrument1 GroundStation0)
	(supports instrument2 image2)
	(supports instrument2 spectrograph1)
	(calibration_target instrument2 GroundStation1)
	(supports instrument3 image2)
	(supports instrument3 spectrograph1)
	(supports instrument3 thermograph0)
	(calibration_target instrument3 GroundStation2)
	(on_board instrument1 satellite1)
	(on_board instrument2 satellite1)
	(on_board instrument3 satellite1)
	(power_avail satellite1)
	(pointing satellite1 Star7)
	(supports instrument4 spectrograph1)
	(supports instrument4 image2)
	(supports instrument4 thermograph0)
	(calibration_target instrument4 GroundStation1)
	(supports instrument5 thermograph0)
	(supports instrument5 image2)
	(supports instrument5 spectrograph1)
	(calibration_target instrument5 GroundStation1)
	(on_board instrument4 satellite2)
	(on_board instrument5 satellite2)
	(power_avail satellite2)
	(pointing satellite2 Phenomenon58)
	(supports instrument6 thermograph0)
	(supports instrument6 image2)
	(calibration_target instrument6 GroundStation2)
	(supports instrument7 thermograph0)
	(supports instrument7 image2)
	(supports instrument7 spectrograph1)
	(calibration_target instrument7 GroundStation0)
	(on_board instrument6 satellite3)
	(on_board instrument7 satellite3)
	(power_avail satellite3)
	(pointing satellite3 Phenomenon15)
	(supports instrument8 image2)
	(supports instrument8 thermograph0)
	(supports instrument8 spectrograph1)
	(calibration_target instrument8 GroundStation0)
	(supports instrument9 image2)
	(supports instrument9 thermograph0)
	(calibration_target instrument9 GroundStation2)
	(supports instrument10 thermograph0)
	(supports instrument10 image2)
	(supports instrument10 spectrograph1)
	(calibration_target instrument10 GroundStation2)
	(on_board instrument8 satellite4)
	(on_board instrument9 satellite4)
	(on_board instrument10 satellite4)
	(power_avail satellite4)
	(pointing satellite4 Planet31)
	(supports instrument11 spectrograph1)
	(supports instrument11 thermograph0)
	(supports instrument11 image2)
	(calibration_target instrument11 GroundStation1)
	(on_board instrument11 satellite5)
	(power_avail satellite5)
	(pointing satellite5 Planet27)
	(supports instrument12 image2)
	(calibration_target instrument12 GroundStation1)
	(supports instrument13 spectrograph1)
	(calibration_target instrument13 GroundStation1)
	(supports instrument14 thermograph0)
	(supports instrument14 image2)
	(supports instrument14 spectrograph1)
	(calibration_target instrument14 GroundStation2)
	(on_board instrument12 satellite6)
	(on_board instrument13 satellite6)
	(on_board instrument14 satellite6)
	(power_avail satellite6)
	(pointing satellite6 Phenomenon22)
	(supports instrument15 thermograph0)
	(supports instrument15 image2)
	(calibration_target instrument15 GroundStation2)
	(supports instrument16 thermograph0)
	(supports instrument16 image2)
	(supports instrument16 spectrograph1)
	(calibration_target instrument16 GroundStation2)
	(on_board instrument15 satellite7)
	(on_board instrument16 satellite7)
	(power_avail satellite7)
	(pointing satellite7 Star34)
)
(:goal (and
	(pointing satellite1 Planet36)
	(pointing satellite2 Planet39)
	(pointing satellite4 Planet27)
	(pointing satellite7 Phenomenon22)
	(have_image Star3 thermograph0)
	(have_image Phenomenon5 image2)
	(have_image Phenomenon6 image2)
	(have_image Star7 thermograph0)
	(have_image Phenomenon8 image2)
	(have_image Planet9 spectrograph1)
	(have_image Phenomenon10 thermograph0)
	(have_image Star11 spectrograph1)
	(have_image Star12 spectrograph1)
	(have_image Phenomenon13 thermograph0)
	(have_image Star14 image2)
	(have_image Phenomenon15 spectrograph1)
	(have_image Planet16 image2)
	(have_image Star17 spectrograph1)
	(have_image Planet18 image2)
	(have_image Star19 thermograph0)
	(have_image Star20 thermograph0)
	(have_image Phenomenon22 spectrograph1)
	(have_image Star23 image2)
	(have_image Star24 thermograph0)
	(have_image Star25 thermograph0)
	(have_image Phenomenon26 spectrograph1)
	(have_image Planet27 spectrograph1)
	(have_image Planet31 thermograph0)
	(have_image Planet32 thermograph0)
	(have_image Phenomenon33 spectrograph1)
	(have_image Star34 thermograph0)
	(have_image Planet35 image2)
	(have_image Planet36 thermograph0)
	(have_image Star37 spectrograph1)
	(have_image Star38 spectrograph1)
	(have_image Planet39 image2)
	(have_image Star41 thermograph0)
	(have_image Phenomenon42 spectrograph1)
	(have_image Phenomenon43 thermograph0)
	(have_image Star44 thermograph0)
	(have_image Star45 image2)
	(have_image Star46 thermograph0)
	(have_image Star47 image2)
	(have_image Star48 thermograph0)
	(have_image Phenomenon49 image2)
	(have_image Planet51 spectrograph1)
	(have_image Planet53 thermograph0)
	(have_image Star54 image2)
	(have_image Phenomenon55 thermograph0)
	(have_image Planet57 thermograph0)
	(have_image Star59 thermograph0)
	(have_image Planet60 thermograph0)
	(have_image Planet61 thermograph0)
	(have_image Planet62 thermograph0)
	(have_image Planet63 image2)
	(have_image Star64 image2)
	(have_image Star65 spectrograph1)
	(have_image Planet66 thermograph0)
	(have_image Planet67 image2)
	(have_image Planet68 thermograph0)
	(have_image Star69 image2)
	(have_image Phenomenon70 spectrograph1)
	(have_image Phenomenon71 spectrograph1)
	(have_image Planet72 image2)
))

)

; plan
1. (switch_on instrument0 satellite0)
   deleted: (power_avail satellite0)
   added: (power_on instrument0)
   goals met: 0 of 64
2. (turn_to satellite0 groundstation2 star44)
   deleted: (pointing satellite0 star44)
   added: (pointing satellite0 groundstation2)
   goals met: 0 of 64
3. (calibrate satellite0 instrument0 groundstation2)
   added: (calibrated instrument0)
   goals met: 0 of 64
4. (turn_to satellite0 phenomenon10 groundstation2)
   deleted: (pointing satellite0 groundstation2)
   added: (pointing satellite0 phenomenon10)
   goals met: 0 of 64
5. (take_image satellite0 phenomenon10 instrument0 thermograph0)
   added: (have_image phenomenon10 thermograph0)
   goals met: 1 of 64
6. (turn_to satellite0 phenomenon13 phenomenon10)
   deleted: (pointing satellite0 phenomenon10)
   added: (pointing satellite0 phenomenon13)
   goals met: 1 of 64
7. (take_image satellite0 phenomenon13 instrument0 thermograph0)
   added: (have_image phenomenon13 thermograph0)
   goals met: 2 of 64
8. (turn_to satellite0 phenomenon15 phenomenon13)
   deleted: (pointing satellite0 phenomenon13)
   added: (pointing satellite0 phenomenon15)
   goals met: 2 of 64
9. (take_image satellite0 phenomenon15 instrument0 spectrograph1)
   added: (have_image phenomenon15 spectrograph1)
   goals met: 3 of 64
10. (turn_to satellite0 phenomenon22 phenomenon15)
   deleted: (pointing satellite0 phenomenon15)
   added: (pointing satellite0 phenomenon22)
   goals met: 3 of 64
11. (take_image satellite0 phenomenon22 instrument0 spectrograph1)
   added: (have_image phenomenon22 spectrograph1)
   goals met: 4 of 64
12. (turn_to satellite0 phenomenon26 phenomenon22)
   deleted: (pointing satellite0 phenomenon22)
   added: (pointing satellite0 phenomenon26)
   goals met: 4 of 64
13. (take_image satellite0 phenomenon26 instrument0 spectrograph1)
   added: (have_image phenomenon26 spectrograph1)
   goals met: 5 of 64
14. (turn_to satellite0 phenomenon33 phenomenon26)
   deleted: (pointing satellite0 phenomenon26)
   added: (pointing satellite0 phenomenon33)
   goals met: 5 of 64
15. (take_image satellite0 phenomenon33 instrument0 spectrograph1)
   added: (have_image phenomenon33 spectrograph1)
   goals met: 6 of 64
16. (turn_to satellite0 phenomenon42 phenomenon33)
   deleted: (pointing satellite0 phenomenon33)
   added: (pointing satellite0 phenomenon42)
   goals met: 6 of 64
17. (take_image satellite0 phenomenon42 instrument0 spectrograph1)
   added: (have_image phenomenon42 spectrograph1)
   goals met: 7 of 64
18. (turn_to satellite0 phenomenon43 phenomenon42)
   deleted: (pointing satellite0 phenomenon42)
   added: (pointing satellite0 phenomenon43)
   goals met: 7 of 64
19. (take_image satellite0 phenomenon43 instrument0 thermograph0)
   added: (have_image phenomenon43 thermograph0)
   goals met: 8 of 64
20. (turn_to satellite0 phenomenon49 phenomenon43)
   deleted: (pointing satellite0 phenomenon43)
   added: (pointing satellite0 phenomenon49)
   goals met: 8 of 64
21. (take_image satellite0 phenomenon49 instrument0 image2)
   added: (have_image phenomenon49 image2)
   goals met: 9 of 64
22. (turn_to satellite0 phenomenon5 phenomenon49)
   deleted: (pointing satellite0 phenomenon49)
   added: (pointing satellite0 phenomenon5)
   goals met: 9 of 64
23. (take_image satellite0 phenomenon5 instrument0 image2)
   added: (have_image phenomenon5 image2)
   goals met: 10 of 64
24. (turn_to satellite0 phenomenon55 phenomenon5)
   deleted: (pointing satellite0 phenomenon5)
   added: (pointing satellite0 phenomenon55)
   goals met: 10 of 64
25. (take_image satellite0 phenomenon55 instrument0 thermograph0)
   added: (have_image phenomenon55 thermograph0)
   goals met: 11 of 64
26. (turn_to satellite0 phenomenon6 phenomenon55)
   deleted: (pointing satellite0 phenomenon55)
   added: (pointing satellite0 phenomenon6)
   goals met: 11 of 64
27. (take_image satellite0 phenomenon6 instrument0 image2)
   added: (have_image phenomenon6 image2)
   goals met: 12 of 64
28. (turn_to satellite0 phenomenon70 phenomenon6)
   deleted: (pointing satellite0 phenomenon6)
   added: (pointing satellite0 phenomenon70)
   goals met: 12 of 64
29. (take_image satellite0 phenomenon70 instrument0 spectrograph1)
   added: (have_image phenomenon70 spectrograph1)
   goals met: 13 of 64
30. (turn_to satellite0 phenomenon71 phenomenon70)
   deleted: (pointing satellite0 phenomenon70)
   added: (pointing satellite0 phenomenon71)
   goals met: 13 of 64
31. (take_image satellite0 phenomenon71 instrument0 spectrograph1)
   added: (have_image phenomenon71 spectrograph1)
   goals met: 14 of 64
32. (turn_to satellite0 phenomenon8 phenomenon71)
   deleted: (pointing satellite0 phenomenon71)
   added: (pointing satellite0 phenomenon8)
   goals met: 14 of 64
33. (take_image satellite0 phenomenon8 instrument0 image2)
   added: (have_image phenomenon8 image2)
   goals met: 15 of 64
34. (turn_to satellite0 planet16 phenomenon8)
   deleted: (pointing satellite0 phenomenon8)
   added: (pointing satellite0 planet16)
   goals met: 15 of 64
35. (take_image satellite0 planet16 instrument0 image2)
   added: (have_image planet16 image2)
   goals met: 16 of 64
36. (turn_to satellite0 planet18 planet16)
   deleted: (pointing satellite0 planet16)
   added: (pointing satellite0 planet18)
   goals met: 16 of 64
37. (take_image satellite0 planet18 instrument0 image2)
   added: (have_image planet18 image2)
   goals met: 17 of 64
38. (turn_to satellite0 planet27 planet18)
   deleted: (pointing satellite0 planet18)
   added: (pointing satellite0 planet27)
   goals met: 17 of 64
39. (take_image satellite0 planet27 instrument0 spectrograph1)
   added: (have_image planet27 spectrograph1)
   goals met: 18 of 64
40. (turn_to satellite0 planet31 planet27)
   deleted: (pointing satellite0 planet27)
   added: (pointing satellite0 planet31)
   goals met: 18 of 64
41. (take_image satellite0 planet31 instrument0 thermograph0)
   added: (have_image planet31 thermograph0)
   goals met: 19 of 64
42. (turn_to satellite0 planet32 planet31)
   deleted: (pointing satellite0 planet31)
   added: (pointing satellite0 planet32)
   goals met: 19 of 64
43. (take_image satellite0 planet32 instrument0 thermograph0)
   added: (have_image planet32 thermograph0)
   goals met: 20 of 64
44. (turn_to satellite0 planet35 planet32)
   deleted: (pointing satellite0 planet32)
   added: (pointing satellite0 planet35)
   goals met: 20 of 64
45. (take_image satellite0 planet35 instrument0 image2)
   added: (have_image planet35 image2)
   goals met: 21 of 64
46. (turn_to satellite0 planet36 planet35)
   deleted: (pointing satellite0 planet35)
   added: (pointing satellite0 planet36)
   goals met: 21 of 64
47. (take_image satellite0 planet36 instrument0 thermograph0)
   added: (have_image planet36 thermograph0)
   goals met: 22 of 64
48. (turn_to satellite0 planet39 planet36)
   deleted: (pointing satellite0 planet36)
   added: (pointing satellite0 planet39)
   goals met: 22 of 64
49. (take_image satellite0 planet39 instrument0 image2)
   added: (have_image planet39 image2)
   goals met: 23 of 64
50. (turn_to satellite0 planet51 planet39)
   deleted: (pointing satellite0 planet39)
   added: (pointing satellite0 planet51)
   goals met: 23 of 64
51. (take_image satellite0 planet51 instrument0 spectrograph1)
   added: (have_image planet51 spectrograph1)
   goals met: 24 of 64
52. (turn_to satellite0 planet53 planet51)
   deleted: (pointing satellite0 planet51)
   added: (pointing satellite0 planet53)
   goals met: 24 of 64
53. (take_image satellite0 planet53 instrument0 thermograph0)
   added: (have_image planet53 thermograph0)
   goals met: 25 of 64
54. (turn_to satellite0 planet57 planet53)
   deleted: (pointing satellite0 planet53)
   added: (pointing satellite0 planet57)
   goals met: 25 of 64
55. (take_image satellite0 planet57 instrument0 thermograph0)
   added: (have_image planet57 thermograph0)
   goals met: 26 of 64
56. (turn_to satellite0 planet60 planet57)
   deleted: (pointing satellite0 planet57)
   added: (pointing satellite0 planet60)
   goals met: 26 of 64
57. (take_image satellite0 planet60 instrument0 thermograph0)
   added: (have_image planet60 thermograph0)
   goals met: 27 of 64
58. (turn_to satellite0 planet61 planet60)
   deleted: (pointing satellite0 planet60)
   added: (pointing satellite0 planet61)
   goals met: 27 of 64
59. (take_image satellite0 planet61 instrument0 thermograph0)
   added: (have_image planet61 thermograph0)
   goals met: 28 of 64
60. (turn_to satellite0 planet62 planet61)
   deleted: (pointing satellite0 planet61)
   added: (pointing satellite0 planet62)
   goals met: 28 of 64
61. (take_image satellite0 planet62 instrument0 thermograph0)
   added: (have_image planet62 thermograph0)
   goals met: 29 of 64
62. (turn_to satellite0 planet63 planet62)
   deleted: (pointing satellite0 planet62)
   added: (pointing satellite0 planet63)
   goals met: 29 of 64
63. (take_image satellite0 planet63 instrument0 image2)
   added: (have_image planet63 image2)
   goals met: 30 of 64
64. (turn_to satellite0 planet66 planet63)
   deleted: (pointing satellite0 planet63)
   added: (pointing satellite0 planet66)
   goals met: 30 of 64
65. (take_image satellite0 planet66 instrument0 thermograph0)
   added: (have_image planet66 thermograph0)
   goals met: 31 of 64
66. (turn_to satellite0 planet67 planet66)
   deleted: (pointing satellite0 planet66)
   added: (pointing satellite0 planet67)
   goals met: 31 of 64
67. (take_image satellite0 planet67 instrument0 image2)
   added: (have_image planet67 image2)
   goals met: 32 of 64
68. (turn_to satellite0 planet68 planet67)
   deleted: (pointing satellite0 planet67)
   added: (pointing satellite0 planet68)
   goals met: 32 of 64
69. (take_image satellite0 planet68 instrument0 thermograph0)
   added: (have_image planet68 thermograph0)
   goals met: 33 of 64
70. (turn_to satellite0 planet72 planet68)
   deleted: (pointing satellite0 planet68)
   added: (pointing satellite0 planet72)
   goals met: 33 of 64
71. (take_image satellite0 planet72 instrument0 image2)
   added: (have_image planet72 image2)
   goals met: 34 of 64
72. (turn_to satellite0 planet9 planet72)
   deleted: (pointing satellite0 planet72)
   added: (pointing satellite0 planet9)
   goals met: 34 of 64
73. (take_image satellite0 planet9 instrument0 spectrograph1)
   added: (have_image planet9 spectrograph1)
   goals met: 35 of 64
74. (turn_to satellite0 star11 planet9)
   deleted: (pointing satellite0 planet9)
   added: (pointing satellite0 star11)
   goals met: 35 of 64
75. (take_image satellite0 star11 instrument0 spectrograph1)
   added: (have_image star11 spectrograph1)
   goals met: 36 of 64
76. (turn_to satellite0 star12 star11)
   deleted: (pointing satellite0 star11)
   added: (pointing satellite0 star12)
   goals met: 36 of 64
77. (take_image satellite0 star12 instrument0 spectrograph1)
   added: (have_image star12 spectrograph1)
   goals met: 37 of 64
78. (turn_to satellite0 star14 star12)
   deleted: (pointing satellite0 star12)
   added: (pointing satellite0 star14)
   goals met: 37 of 64
79. (take_image satellite0 star14 instrument0 image2)
   added: (have_image star14 image2)
   goals met: 38 of 64
80. (turn_to satellite0 star17 star14)
   deleted: (pointing satellite0 star14)
   added: (pointing satellite0 star17)
   goals met: 38 of 64
81. (take_image satellite0 star17 instrument0 spectrograph1)
   added: (have_image star17 spectrograph1)
   goals met: 39 of 64
82. (turn_to satellite0 star19 star17)
   deleted: (pointing satellite0 star17)
   added: (pointing satellite0 star19)
   goals met: 39 of 64
83. (take_image satellite0 star19 instrument0 thermograph0)
   added: (have_image star19 thermograph0)
   goals met: 40 of 64
84. (turn_to satellite0 star20 star19)
   deleted: (pointing satellite0 star19)
   added: (pointing satellite0 star20)
   goals met: 40 of 64
85. (take_image satellite0 star20 instrument0 thermograph0)
   added: (have_image star20 thermograph0)
   goals met: 41 of 64
86. (turn_to satellite0 star23 star20)
   deleted: (pointing satellite0 star20)
   added: (pointing satellite0 star23)
   goals met: 41 of 64
87. (take_image satellite0 star23 instrument0 image2)
   added: (have_image star23 image2)
   goals met: 42 of 64
88. (turn_to satellite0 star24 star23)
   deleted: (pointing satellite0 star23)
   added: (pointing satellite0 star24)
   goals met: 42 of 64
89. (take_image satellite0 star24 instrument0 thermograph0)
   added: (have_image star24 thermograph0)
   goals met: 43 of 64
90. (turn_to satellite0 star25 star24)
   deleted: (pointing satellite0 star24)
   added: (pointing satellite0 star25)
   goals met: 43 of 64
91. (take_image satellite0 star25 instrument0 thermograph0)
   added: (have_image star25 thermograph0)
   goals met: 44 of 64
92. (turn_to satellite0 star3 star25)
   deleted: (pointing satellite0 star25)
   added: (pointing satellite0 star3)
   goals met: 44 of 64
93. (take_image satellite0 star3 instrument0 thermograph0)
   added: (have_image star3 thermograph0)
   goals met: 45 of 64
94. (turn_to satellite0 star34 star3)
   deleted: (pointing satellite0 star3)
   added: (pointing satellite0 star34)
   goals met: 45 of 64
95. (take_image satellite0 star34 instrument0 thermograph0)
   added: (have_image star34 thermograph0)
   goals met: 46 of 64
96. (turn_to satellite0 star37 star34)
   deleted: (pointing satellite0 star34)
   added: (pointing satellite0 star37)
   goals met: 46 of 64
97. (take_image satellite0 star37 instrument0 spectrograph1)
   added: (have_image star37 spectrograph1)
   goals met: 47 of 64
98. (turn_to satellite0 star38 star37)
   deleted: (pointing satellite0 star37)
   added: (pointing satellite0 star38)
   goals met: 47 of 64
99. (take_image satellite0 star38 instrument0 spectrograph1)
   added: (have_image star38 spectrograph1)
   goals met: 48 of 64
100. (turn_to satellite0 star41 star38)
   deleted: (pointing satellite0 star38)
   added: (pointing satellite0 star41)
   goals met: 48 of 64
101. (take_image satellite0 star41 instrument0 thermograph0)
   added: (have_image star41 thermograph0)
   goals met: 49 of 64
102. (turn_to satellite0 star44 star41)
   deleted: (pointing satellite0 star41)
   added: (pointing satellite0 star44)
   goals met: 49 of 64
103. (take_image satellite0 star44 instrument0 thermograph0)
   added: (have_image star44 thermograph0)
   goals met: 50 of 64
104. (turn_to satellite0 star45 star44)
   deleted: (pointing satellite0 star44)
   added: (pointing satellite0 star45)
   goals met: 50 of 64
105. (take_image satellite0 star45 instrument0 image2)
   added: (have_image star45 image2)
   goals met: 51 of 64
106. (turn_to satellite0 star46 star45)
   deleted: (pointing satellite0 star45)
   added: (pointing satellite0 star46)
   goals met: 51 of 64
107. (take_image satellite0 star46 instrument0 thermograph0)
   added: (have_image star46 thermograph0)
   goals met: 52 of 64
108. (turn_to satellite0 star47 star46)
   deleted: (pointing satellite0 star46)
   added: (pointing satellite0 star47)
   goals met: 52 of 64
109. (take_image satellite0 star47 instrument0 image2)
   added: (have_image star47 image2)
   goals met: 53 of 64
110. (turn_to satellite0 star48 star47)
   deleted: (pointing satellite0 star47)
   added: (pointing satellite0 star48)
   goals met: 53 of 64
111. (take_image satellite0 star48 instrument0 thermograph0)
   added: (have_image star48 thermograph0)
   goals met: 54 of 64
112. (turn_to satellite0 star54 star48)
   deleted: (pointing satellite0 star48)
   added: (pointing satellite0 star54)
   goals met: 54 of 64
113. (take_image satellite0 star54 instrument0 image2)
   added: (have_image star54 image2)
   goals met: 55 of 64
114. (turn_to satellite0 star59 star54)
   deleted: (pointing satellite0 star54)
   added: (pointing satellite0 star59)
   goals met: 55 of 64
115. (take_image satellite0 star59 instrument0 thermograph0)
   added: (have_image star59 thermograph0)
   goals met: 56 of 64
116. (turn_to satellite0 star64 star59)
   deleted: (pointing satellite0 star59)
   added: (pointing satellite0 star64)
   goals met: 56 of 64
117. (take_image satellite0 star64 instrument0 image2)
   added: (have_image star64 image2)
   goals met: 57 of 64
118. (turn_to satellite0 star65 star64)
   deleted: (pointing satellite0 star64)
   added: (pointing satellite0 star65)
   goals met: 57 of 64
119. (take_image satellite0 star65 instrument0 spectrograph1)
   added: (have_image star65 spectrograph1)
   goals met: 58 of 64
120. (turn_to satellite0 star69 star65)
   deleted: (pointing satellite0 star65)
   added: (pointing satellite0 star69)
   goals met: 58 of 64
121. (take_image satellite0 star69 instrument0 image2)
   added: (have_image star69 image2)
   goals met: 59 of 64
122. (turn_to satellite0 star7 star69)
   deleted: (pointing satellite0 star69)
   added: (pointing satellite0 star7)
   goals met: 59 of 64
123. (take_image satellite0 star7 instrument0 thermograph0)
   added: (have_image star7 thermograph0)
   goals met: 60 of 64
124. (turn_to satellite1 planet36 star7)
   deleted: (pointing satellite1 star7)
   added: (pointing satellite1 planet36)
   goals met: 61 of 64
125. (turn_to satellite2 planet39 phenomenon58)
   deleted: (pointing satellite2 phenomenon58)
   added: (pointing satellite2 planet39)
   goals met: 62 of 64
126. (turn_to satellite4 planet27 planet31)
   deleted: (pointing satellite4 planet31)
   added: (pointing satellite4 planet27)
   goals met: 63 of 64
127. (turn_to satellite7 phenomenon22 star34)
   deleted: (pointing satellite7 star34)
   added: (pointing satellite7 phenomenon22)
   goals met: 64 of 64
